Revit 2027 API
Element.CanBeHidden Method
Indicates if the element can be hidden in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanBeHidden(
	View pView
)
Public Function CanBeHidden (
	pView As View
) As Boolean
public:
bool CanBeHidden(
	View^ pView
)
member CanBeHidden :
        pView : View -> bool
Parameters
pView View
Return Value
Boolean
If the element is not permitted to be hidden, false is returned.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when argument is null.
Remarks
 See discussion for some types of elements which may not be hidden. Note: elements in families can only be hidden temporarily.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace